In [1]:
import pandas as pd
from sqlalchemy import create_engine
import os

In [29]:
df = pd.read_csv("ChocolateSales.csv", sep=",")
# https://www.kaggle.com/datasets/atharvasoundankar/chocolate-sales

In [3]:
df.dtypes

Sales Person     object
Country          object
Product          object
Date             object
Amount           object
Boxes Shipped     int64
dtype: object

In [25]:
df = df.astype({
    "Sales Person": str,
    "Country":str,
    "Product": str,
    "Boxes Shipped": int
})

df['Amount'] = df['Amount'].astype(str).str.replace(r'[\$]', '', regex=True).str.strip()
df['Amount'] = pd.to_numeric(df['Amount'], errors='coerce')

In [26]:
df.isna().sum()

Sales Person       0
Country            0
Product            0
Date               0
Amount           981
Boxes Shipped      0
Year               0
dtype: int64

In [38]:
df['Date'] = pd.to_datetime(df['Date'], format='%d-%b-%y', errors='coerce')
df['Year'] = df['Date'].dt.year

In [8]:
df.groupby('Country')['Amount'].sum()

Country
Australia      13188.0
Canada          8589.0
India          10031.0
New Zealand     7616.0
UK              5761.0
USA            12635.0
Name: Amount, dtype: float64

In [23]:
# df2 = pd.DataFrame(["Product", "Sum"])
df2 = df.groupby('Product').agg(Total=('Amount', 'sum')).reset_index()
top_sell_brands = df2.sort_values(by="Total", ascending=False).head(5)

In [58]:
pd.to_datetime(df['Date'], format='%b')
frame = pd.DataFrame({
    'date': pd.to_datetime(df['Date'], format='mixed', dayfirst=True) })
df['month'] = frame['date'].dt.month_name()
df

,Sales Person,Country,Product,Date,Amount,Boxes Shipped,Year,month
0,Jehu Rudeforth,UK,Mint Chip Choco,2022-01-04,"$5,320",180,2022,January
1,Van Tuxwell,India,85% Dark Bars,2022-08-01,"$7,896",94,2022,August
2,Gigi Bohling,India,Peanut Butter Cubes,2022-07-07,"$4,501",91,2022,July
3,Jan Morforth,Australia,Peanut Butter Cubes,2022-04-27,"$12,726",342,2022,April
4,Jehu Rudeforth,UK,Peanut Butter Cubes,2022-02-24,"$13,685",184,2022,February
...,...,...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,2022-05-17,"$4,410",323,2022,May
1090,Jehu Rudeforth,USA,White Choc,2022-06-07,"$6,559",119,2022,June
1091,Ches Bonnell,Canada,Organic Choco Syrup,2022-07-26,$574,217,2022,July
1092,Dotty Strutley,India,Eclairs,2022-07-28,"$2,086",384,2022,July
1093,Karlen McCaffrey,India,70% Dark Bites,2022-05-23,"$5,075",344,2022,May

In [62]:
df.groupby( 'month').agg(Total=('Amount', 'sum')).reset_index()
# df['month']

      month                                              Total
0     April  $12,726 $3,990 $3,017 $14,749 $14,798 $2,030 $...
1    August  $7,896 $8,379 $2,653 $7,602 $19,453 $2,002 $9,...
2  February  $13,685 $4,067 $8,799 $1,267 $7,672 $1,652 $6,...
3   January  $5,320 $13,685 $4,704 $1,442 $6,790 $168 $9,73...
4      July  $4,501 $2,835 $168 $4,025 $9,492 $9,583 $147 $...
5      June  $5,376 $1,085 $6,888 $5,061 $12,446 $6,839 $93...
6     March  $3,080 $3,703 $3,003 $4,865 $12,313 $2,800 $7,...
7       May  $4,753 $1,722 $4,284 $2,163 $3,654 $16,793 $27...

In [39]:
df.head(10)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped,Year
0,Jehu Rudeforth,UK,Mint Chip Choco,2022-01-04,"$5,320",180,2022
1,Van Tuxwell,India,85% Dark Bars,2022-08-01,"$7,896",94,2022
2,Gigi Bohling,India,Peanut Butter Cubes,2022-07-07,"$4,501",91,2022
3,Jan Morforth,Australia,Peanut Butter Cubes,2022-04-27,"$12,726",342,2022
4,Jehu Rudeforth,UK,Peanut Butter Cubes,2022-02-24,"$13,685",184,2022
5,Van Tuxwell,India,Smooth Sliky Salty,2022-06-06,"$5,376",38,2022
6,Oby Sorrel,UK,99% Dark & Pure,2022-01-25,"$13,685",176,2022
7,Gunar Cockshoot,Australia,After Nines,2022-03-24,"$3,080",73,2022
8,Jehu Rudeforth,New Zealand,50% Dark Bites,2022-04-20,"$3,990",59,2022
9,Brien Boise,Australia,99% Dark & Pure,2022-07-04,"$2,835",102,2022